app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants" ORDER BY created_at DESC

  def create
    @restaurant = current_user.restaurants.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "cuisine", "address", "url", "best_thing_to_order", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "name" = $1, "best_thing_to_order" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "New Golden Gate"], ["best_thing_to_order", ""], ["updated_at", "2019-09-13 06:03:27.811822"], ["id", 92]]

    def set_restaurant
      @restaurant = current_user.restaurants.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]